{"data":{"markdownRemark":{"frontmatter":{"title":"New Blog New Beginnings"},"html":"<p>My first blog. Just getting the hang of it and posting some random thoughts.</p>\n<!--more-->\n<h1>Quick Background</h1>\n<p>My first blog. Just getting the hang of it and posting some random thoughts.\nWell technically speaking it's not my first blog. I have tried starting a blog many times before, say around 5 times or so; and boy I have failed, miserably. Every single time I used to sit down, try to search for a platform for days, finalize on a theme for another couple of days and by the time I had everything setup and a couple of blogs posted, I found myself out of energy and will to write anymore. Maybe I was running after the idea of writing a blog to earn a lot of money. I guess it was too naive of me to assume that money would just start pouring from day one. Maybe I was running after recognition, I guess it was too naive of me to assume that I would start generating huge traffic from first hour. Enough whining, I started blogs in past with different goals. Didn't work out, no issues. New goal.</p>\n<h1>What's the plan</h1>\n<p>Unlike last time, and before that, and so on I do have a stable day job, no monetization needed from blog. Recognition, umm.. not sure if I really want that anymore. Don't get me wrong, I do like making new friends and connections, but that is not the sole motivation anymore. So why start a blog? Well I am software developer by day and freelancer during night, so I hardly get to write at all!!! Recently I also started reading books, (yeah wasn't doing that till now) and I like it. So I thought why not start writing again, whatever I can, whenever I can. I have read that writing improves your ( pardon my lack of word ) <em>writing</em> skills. So that's my motivation here, to improve my skills, sounds fair ?</p>\n<h1>What would I post</h1>\n<p>Umm... General random thoughts, I do some coding at work, so will post some tutorials and articles on various tech topics. At this point I am not really sure what would be the scope of articles, but general random stuff + tech is what I have in mind as of now.</p>\n<h2>Are you done?</h2>\n<p>Won't bore you anymore. This time I am not going to fail. Sincere motivation :), at least one post per week is what I am targeting for.</p>\n<p>See you around :)\n{{&#x3C; youtube I8<em>pURh3l</em>s >}}</p>"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"posts/life/2018/08/new-blog-new-beginnings/","prev":null,"next":{"frontmatter":{"title":"Hackerrank Solutions in Golang","description":"My solutions to hackerrank practice problems in golang with explantions.","tags":["hackerrank","golang","coding"],"path":"posts/coding/hackerrank/2018/08/hackerrank-solutions-in-golang/"},"fields":{"readingTime":{"text":"2 min read"}}}}}