{"data":{"markdownRemark":{"frontmatter":{"title":"New Mornings New Subscribers"},"html":"<p>It's been a month since I started writing and uploading youtube videos. Just taking a minute to thank everyone for their support and sharing some stats for this month.</p>\n<!--more-->\n<h1>Thank You</h1>\n<p>Hey everyone, thank you so much for your support on my YouTube Channel as well as on blog over here. It's been a month since I started writting and I am loving it. The initial periods were tough and went very slow, however this just feels like one of my hobbies which I love and I enjoy recording videos as well as writing over here. All of this was possible because of your support, constructive criticism, and honest feedback. It kept me motivated to upload and write almost every day, and I plan to keep doing that as long as I can.</p>\n<p>I'll be lying if I say I wasn't afraid about the response I would get, or the criticism I would face, but now I feel more confident and have full faith that I can carry on with the plans I have in mind for the blog as well as my channel. The feeling of getting a new subscriber almost every morning is just too addicting. <strong><em>New Mornings, New Subscribers</em></strong>.</p>\n<h1>Some stats</h1>\n<p>In the last month I have uploaded 26 videos on YouTuube, and 24 posts on my blog. I have gained 109 subscribers and around 2500+ views on my channnel. On an average I get 10-15 daily views on my channel and I look forward to increase these numbers when I am posting another update. Am I happy with these numbers ? Yes, of course!!! am I satisfied? Hell NO!!!. </p>\n<h1>Future Plans</h1>\n<p>I am trying to change my daily routine and adjust it in a way wherein I can post 2 videos and blogs everyday instead of just one. I am pretty sure I can achieve that starting first week of October. As for the content, I have a lot of content planned for atleast next six months, so the chances of me running out of content any time soon is next to none.</p>\n<p>Once again thank you for all your support guys, this means a lot to me. </p>\n<p>Subscribe to my <a href=\"https://www.youtube.com/channel/UC4syrEYE9_fzeVBajZIyHlA\">youtube channel</a> for regular updates, subscribe to my mailing list below, follow me on <a href=\"https://www.twitter.com/rishabhjain1403\">twitter</a> , drop me a mail or leave a comment here if you want to connect with me and I'll reply as soon as possible. Thanks</p>\n<p>Stay tuned and see you around :)</p>"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"posts/life/2018/09/new-mornings-new-subscribers/","prev":{"frontmatter":{"title":"They Can Smell What You are Cooking","description":"In this post we will discuss some of the privacy concerns that we will face while we browse the internet. Have a safe browsing!!!.","categories":["privacy"],"date":"September 19th, 2018","path":"posts/privacy/2018/09/they-can-smell-what-you-are-cooking/"},"fields":{"readingTime":{"text":"4 min read"}}},"next":{"frontmatter":{"title":"Hackerrank | Solution of Between Two Sets in Golang","description":"In this one we will discuss the solution of Between two sets in Golang. It wraps good amount of logic, will be fun solving it. Let's dive right into it.","categories":["coding","golang","hackerrank"],"date":"September 21st, 2018","path":"posts/coding/hackerrank/2018/09/hackerrank-solution-of-between-two-sets-in-golang/"},"fields":{"readingTime":{"text":"7 min read"}}}}}